import 'package:kakeibo/model/table_calmn_name.dart';
import 'package:sqflite/sqflite.dart';

class DataBaseMigrate {
  toV3(Database db) async {
    print('データベースの更新処理1が呼び出されました');
    await db.transaction((txn) async {

      // budgetのテーブルのカラム名を変更する
      // date -> month
      await txn.execute('DROP TABLE IF EXISTS new_budget');

      await txn.execute('''
        CREATE TABLE new_budget (
	      ${SqfBudget.id} INTEGER PRIMARY KEY,
	      ${SqfBudget.expenseBigCategoryId} INTEGER NOT NULL,
	      ${SqfBudget.month} TEXT NOT NULL,
	      ${SqfBudget.price} INTEGER NOT NULL
        );
      ''');

      const sql = '''
        INSERT INTO new_budget (
        ${SqfBudget.id},
        ${SqfBudget.expenseBigCategoryId},
        ${SqfBudget.month},
        ${SqfBudget.price})
        SELECT * FROM ${SqfBudget.tableName};
      ''';
      await txn.rawInsert(sql);

      await txn.execute('''
        DROP TABLE ${SqfBudget.tableName};
        ALTER TABLE new_budget RENAME TO ${SqfBudget.tableName};
      ''');

      print('データベースの更新処理1が完了しました');

    });
  }

  toV4(Database db) async {
    await db.transaction((txn) async {
      print('データベースの更新処理2が呼び出されました');
      // budgetのテーブルのカラム名を変更する
      // date -> month
      const sql = '''
        INSERT INTO expense (expense_small_category_id, date, price, memo, income_source_big_category)
        VALUES
        (3, '20250326', 660, '', 1),
        (4, '20250326', 282, '', 1),
        (-1, '20250326', 1351, '[保留:クリーニング] クリーニング', 1),
        (1, '20250327', 213, '朝ごはん', 1),
        (3, '20250327', 560, '', 1),
        (1, '20250327', 200, '', 1),
        (6, '20250328', 2500, 'フットサル', 1),
        (1, '20250328', 492, 'おにぎり', 1),
        (0, '20250328', 316, '', 1),
        (1, '20250329', 130, '', 1),
        (15, '20250329', 1600, 'そば', 1),
        (15, '20250329', 500, 'ジェラート', 1),
        (15, '20250329', 928, 'パン', 1),
        (15, '20250329', 3190, '', 1),
        (15, '20250330', 2350, 'アプルパイ', 1),
        (1, '20250330', 120, '', 1),
        (15, '20250330', 100, '', 1),
        (15, '20250330', 200, '豚まん', 1),
        (0, '20250330', 545, '', 1),
        (7, '20250331', 6000, '福田さん', 1),
        (3, '20250331', 660, '', 1),
        (0, '20250331', 1748, '', 1),
        (3, '20250402', 660, '', 1),
        (2, '20250402', 890, '', 1),
        (0, '20250402', 1500, '', 1),
        (3, '20250403', 560, '', 1),
        (0, '20250403', 214, '', 1),
        (4, '20250403', 2626, '柔軟剤など', 1),
        (2, '20250404', 1400, '', 1),
        (6, '20250405', 1000, '', 1),
        (0, '20250405', 1511, '', 1),
        (6, '20250405', 2500, 'フットサル', 1),
        (0, '20250405', 560, 'スイーツ', 1),
        (6, '20250406', 187, '', 1),
        (0, '20250406', 1100, '', 1),
        (4, '20250406', 2449, '', 1),
        (2, '20250407', 1100, '', 1),
        (3, '20250408', 560, '', 1),
        (2, '20250408', 470, '', 1),
        (0, '20250408', 2003, '', 1),
        (-1, '20250409', 1699, '[保留:雑費] PCケース', 1),
        (6, '20250409', 2300, 'フットサル', 1),
        (1, '20250410', 150, '', 1),
        (2, '20250410', 1050, '', 1),
        (0, '20250410', 504, '', 1),
        (1, '20250411', 139, '', 1),
        (3, '20250411', 660, '', 1),
        (0, '20250412', 2425, '', 1),
        (8, '20250413', 1200, 'ドリチケ', 1),
        (2, '20250413', 1030, '', 1),
        (8, '20250413', 8200, '', 1),
        (0, '20250413', 735, '', 1),
        (6, '20250414', 1000, 'プレゼント', 1),
        (3, '20250414', 726, '', 1),
        (3, '20250415', 660, '', 1),
        (7, '20250415', 2000, '', 1),
        (0, '20250415', 85, '', 1),
        (4, '20250415', 251, '', 1),
        (6, '20250416', 2200, 'フットサル', 1),
        (14, '20250416', 500, '技術書', 1),
        (3, '20250417', 528, '', 1),
        (2, '20250417', 1200, '', 1),
        (10, '20250417', 215, '', 1),
        (1, '20250418', 117, '', 1),
        (3, '20250418', 660, '', 1),
        (12, '20250418', 13460, '染めた', 1),
        (2, '20250418', 1350, '', 1),
        (10, '20250418', 3000, 'PASMO', 1),
        (10, '20250418', 200, '', 1),
        (4, '20250418', 4020, 'コンタクト', 1),
        (6, '20250419', 7560, '結婚祝い', 1),
        (0, '20250419', 281, '', 1),
        (0, '20250420', 2511, '', 1),
        (4, '20250420', 110, '', 1),
        (7, '20250420', 6260, '', 1),
        (0, '20250421', 1200, '', 1),
        (1, '20250421', 419, '', 1),
        (5, '20250421', 1320, 'ドラえもんメモ帳', 1),
        (0, '20250421', 321, '', 1),
        (14, '20250421', 1182, '送料', 1),
        (0, '20250422', 560, '', 1),
        (3, '20250422', 561, '', 1),
        (2, '20250422', 1050, '', 1),
        (15, '20250329', 22555, '軽井沢旅行', 1),
        (6, '20250423', 2200, 'フットサル', 1),
        (2, '20250424', 900, 'うどん', 1),
        (0, '20250424', 1279, '', 1);
        ''';

      await txn.rawInsert(sql);

      print('データベースの更新処理1が完了しました');
    });
  }

  toV5(Database db) async {
    print('データベースの更新処理1が呼び出されました');
    await db.transaction((txn) async {

      await txn.execute('''
        ALTER TABLE new_budget RENAME TO ${SqfBudget.tableName};
      ''');

      print('データベースの更新処理1が完了しました');

    });
  }
}
